 IDENTIFICATION DIVISION.
 PROGRAM-ID. XMSCOB2.
 AUTHOR. DENNIS OLENICK, OPT-TECH DATA PROCESSING.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  INFILE         PIC X(15) VALUE 'SAMP.DAT/'.
 01  OUTFILE        PIC X(15) VALUE 'SORTED.DAT/'.
 01  CTL-STMT       PIC X(40) VALUE 'S(1,10,C,A)/'.
*-> NOTE THE "/" AFTER THE PARAMETERS IS REQUIRED <-
 01  NUM-RECS       PIC 999 COMP-0.
 01  RET-CODE       PIC 999 COMP-0.
 01  NUMBER-RECORDS-DISP PIC 999.
 01  STATUS-CODE-DISP    PIC 999.
 PROCEDURE DIVISION.
 MAINLINE.
     DISPLAY 'CALLING OPT-TECH SORT...'.
     CALL 'SORTIC' USING INFILE,               
                         OUTFILE,
                         CTL-STMT,
                         NUM-RECS,
                         RET-CODE.
     DISPLAY 'BACK FROM OPT-TECH SORT'.
     MOVE NUM-RECS  TO NUMBER-RECORDS-DISP.
     MOVE RET-CODE  TO STATUS-CODE-DISP. 
     DISPLAY 'NUMBER RECORDS =', NUMBER-RECORDS-DISP.
     DISPLAY 'STATUS CODE    =', STATUS-CODE-DISP.
     STOP RUN.
